#include <iostream>
#include <cstring>
using namespace std;

int main()
{
	int i;
	int s;
	int a[9];
	int b[10];
	
	s=0;
	memset(b,0,sizeof(b));
	
	//for (i=123;i<329;i++)
	for (i=123;i<329;i++)
	{
		a[0]=i/100;
 		a[1]=i/10%10;
 		a[2]=i%10;
 		
 		a[3]=2*i/100;
 		a[4]=2*i/10%10;
 		a[5]=2*i%10;
 		
		a[6]=3*i/100;
 		a[7]=3*i/10%10;
 		a[8]=3*i%10;//如果前面不限制329，超过333之后，这里就会溢出 
		
		//cout << "++++" << a[0] << endl;
		
		//把这尾数放到b数组中，注意这里的尾数实际上有0~9,10类 
		b[a[0]]++;
		b[a[1]]++;
		b[a[2]]++;
		b[a[3]]++;
		b[a[4]]++;
		b[a[5]]++;
		b[a[6]]++;
		b[a[7]]++;
		b[a[8]]++;
		
		//只看1-9（如果只看0-8，重新选择即可） 
		//s = b[1]&&b[2]&&b[3]&&b[4]&&b[5]&&b[6]&&b[7]&&b[8]&&b[9];
		s = b[1]*b[2]*b[3]*b[4]*b[5]*b[6]*b[7]*b[8]*b[9];// 
		if (s != 0)
		{
				cout << i <<' ' << 2*i <<' ' << 3*i <<' '<< endl;	
		}
		memset(b,0,sizeof(b));
	};

	return 0;
}
